/* automatically generated by rust-bindgen 0.72.1 */
/* NB: generated on FreeBSD 16.0 amd64 */

pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __time_t = __int64_t;
pub type __off_t = __int64_t;
pub type time_t = __time_t;
pub type u_int = ::std::os::raw::c_uint;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type off_t = __off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec:  time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"]
        [::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"]
        [::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bintime {
    pub sec:  time_t,
    pub frac: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bintime"][::std::mem::size_of::<bintime>() - 16usize];
    ["Alignment of bintime"][::std::mem::align_of::<bintime>() - 8usize];
    ["Offset of field: bintime::sec"]
        [::std::mem::offset_of!(bintime, sec) - 0usize];
    ["Offset of field: bintime::frac"]
        [::std::mem::offset_of!(bintime, frac) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gctl_req_arg {
    pub nlen:   u_int,
    pub name:   *mut ::std::os::raw::c_char,
    pub offset: off_t,
    pub flag:   ::std::os::raw::c_int,
    pub len:    ::std::os::raw::c_int,
    pub value:  *mut ::std::os::raw::c_void,
    pub kvalue: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gctl_req_arg"][::std::mem::size_of::<gctl_req_arg>() - 48usize];
    ["Alignment of gctl_req_arg"]
        [::std::mem::align_of::<gctl_req_arg>() - 8usize];
    ["Offset of field: gctl_req_arg::nlen"]
        [::std::mem::offset_of!(gctl_req_arg, nlen) - 0usize];
    ["Offset of field: gctl_req_arg::name"]
        [::std::mem::offset_of!(gctl_req_arg, name) - 8usize];
    ["Offset of field: gctl_req_arg::offset"]
        [::std::mem::offset_of!(gctl_req_arg, offset) - 16usize];
    ["Offset of field: gctl_req_arg::flag"]
        [::std::mem::offset_of!(gctl_req_arg, flag) - 24usize];
    ["Offset of field: gctl_req_arg::len"]
        [::std::mem::offset_of!(gctl_req_arg, len) - 28usize];
    ["Offset of field: gctl_req_arg::value"]
        [::std::mem::offset_of!(gctl_req_arg, value) - 32usize];
    ["Offset of field: gctl_req_arg::kvalue"]
        [::std::mem::offset_of!(gctl_req_arg, kvalue) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gctl_req {
    pub version: u_int,
    pub serial:  u_int,
    pub narg:    u_int,
    pub arg:     *mut gctl_req_arg,
    pub lerror:  u_int,
    pub error:   *mut ::std::os::raw::c_char,
    pub reqt:    *mut gctl_req_table,
    pub nerror:  ::std::os::raw::c_int,
    pub serror:  *mut sbuf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gctl_req"][::std::mem::size_of::<gctl_req>() - 64usize];
    ["Alignment of gctl_req"][::std::mem::align_of::<gctl_req>() - 8usize];
    ["Offset of field: gctl_req::version"]
        [::std::mem::offset_of!(gctl_req, version) - 0usize];
    ["Offset of field: gctl_req::serial"]
        [::std::mem::offset_of!(gctl_req, serial) - 4usize];
    ["Offset of field: gctl_req::narg"]
        [::std::mem::offset_of!(gctl_req, narg) - 8usize];
    ["Offset of field: gctl_req::arg"]
        [::std::mem::offset_of!(gctl_req, arg) - 16usize];
    ["Offset of field: gctl_req::lerror"]
        [::std::mem::offset_of!(gctl_req, lerror) - 24usize];
    ["Offset of field: gctl_req::error"]
        [::std::mem::offset_of!(gctl_req, error) - 32usize];
    ["Offset of field: gctl_req::reqt"]
        [::std::mem::offset_of!(gctl_req, reqt) - 40usize];
    ["Offset of field: gctl_req::nerror"]
        [::std::mem::offset_of!(gctl_req, nerror) - 48usize];
    ["Offset of field: gctl_req::serror"]
        [::std::mem::offset_of!(gctl_req, serror) - 56usize];
};
unsafe extern "C" {
    pub fn geom_stats_close();
}
unsafe extern "C" {
    pub fn geom_stats_resync();
}
unsafe extern "C" {
    pub fn geom_stats_open() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn geom_stats_snapshot_get() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn geom_stats_snapshot_free(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn geom_stats_snapshot_timestamp(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut timespec,
    );
}
unsafe extern "C" {
    pub fn geom_stats_snapshot_reset(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn geom_stats_snapshot_next(
        arg1: *mut ::std::os::raw::c_void,
    ) -> *mut devstat;
}
unsafe extern "C" {
    pub fn geom_getxml() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn geom_getxml_geom(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gconf {
    pub lh_first: *mut gconfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gconf"][::std::mem::size_of::<gconf>() - 8usize];
    ["Alignment of gconf"][::std::mem::align_of::<gconf>() - 8usize];
    ["Offset of field: gconf::lh_first"]
        [::std::mem::offset_of!(gconf, lh_first) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gident {
    pub lg_id:   *mut ::std::os::raw::c_void,
    pub lg_ptr:  *mut ::std::os::raw::c_void,
    pub lg_what: gident__bindgen_ty_1,
}
pub const gident_ISCLASS: gident__bindgen_ty_1 = 0;
pub const gident_ISGEOM: gident__bindgen_ty_1 = 1;
pub const gident_ISPROVIDER: gident__bindgen_ty_1 = 2;
pub const gident_ISCONSUMER: gident__bindgen_ty_1 = 3;
pub type gident__bindgen_ty_1 = ::std::os::raw::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gident"][::std::mem::size_of::<gident>() - 24usize];
    ["Alignment of gident"][::std::mem::align_of::<gident>() - 8usize];
    ["Offset of field: gident::lg_id"]
        [::std::mem::offset_of!(gident, lg_id) - 0usize];
    ["Offset of field: gident::lg_ptr"]
        [::std::mem::offset_of!(gident, lg_ptr) - 8usize];
    ["Offset of field: gident::lg_what"]
        [::std::mem::offset_of!(gident, lg_what) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gmesh {
    pub lg_class: gmesh__bindgen_ty_1,
    pub lg_ident: *mut gident,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gmesh__bindgen_ty_1 {
    pub lh_first: *mut gclass,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gmesh__bindgen_ty_1"]
        [::std::mem::size_of::<gmesh__bindgen_ty_1>() - 8usize];
    ["Alignment of gmesh__bindgen_ty_1"]
        [::std::mem::align_of::<gmesh__bindgen_ty_1>() - 8usize];
    ["Offset of field: gmesh__bindgen_ty_1::lh_first"]
        [::std::mem::offset_of!(gmesh__bindgen_ty_1, lh_first) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gmesh"][::std::mem::size_of::<gmesh>() - 16usize];
    ["Alignment of gmesh"][::std::mem::align_of::<gmesh>() - 8usize];
    ["Offset of field: gmesh::lg_class"]
        [::std::mem::offset_of!(gmesh, lg_class) - 0usize];
    ["Offset of field: gmesh::lg_ident"]
        [::std::mem::offset_of!(gmesh, lg_ident) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gconfig {
    pub lg_config: gconfig__bindgen_ty_1,
    pub lg_name:   *mut ::std::os::raw::c_char,
    pub lg_val:    *mut ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gconfig__bindgen_ty_1 {
    pub le_next: *mut gconfig,
    pub le_prev: *mut *mut gconfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gconfig__bindgen_ty_1"]
        [::std::mem::size_of::<gconfig__bindgen_ty_1>() - 16usize];
    ["Alignment of gconfig__bindgen_ty_1"]
        [::std::mem::align_of::<gconfig__bindgen_ty_1>() - 8usize];
    ["Offset of field: gconfig__bindgen_ty_1::le_next"]
        [::std::mem::offset_of!(gconfig__bindgen_ty_1, le_next) - 0usize];
    ["Offset of field: gconfig__bindgen_ty_1::le_prev"]
        [::std::mem::offset_of!(gconfig__bindgen_ty_1, le_prev) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gconfig"][::std::mem::size_of::<gconfig>() - 32usize];
    ["Alignment of gconfig"][::std::mem::align_of::<gconfig>() - 8usize];
    ["Offset of field: gconfig::lg_config"]
        [::std::mem::offset_of!(gconfig, lg_config) - 0usize];
    ["Offset of field: gconfig::lg_name"]
        [::std::mem::offset_of!(gconfig, lg_name) - 16usize];
    ["Offset of field: gconfig::lg_val"]
        [::std::mem::offset_of!(gconfig, lg_val) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gclass {
    pub lg_id:     *mut ::std::os::raw::c_void,
    pub lg_name:   *mut ::std::os::raw::c_char,
    pub lg_class:  gclass__bindgen_ty_1,
    pub lg_geom:   gclass__bindgen_ty_2,
    pub lg_config: gconf,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gclass__bindgen_ty_1 {
    pub le_next: *mut gclass,
    pub le_prev: *mut *mut gclass,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gclass__bindgen_ty_1"]
        [::std::mem::size_of::<gclass__bindgen_ty_1>() - 16usize];
    ["Alignment of gclass__bindgen_ty_1"]
        [::std::mem::align_of::<gclass__bindgen_ty_1>() - 8usize];
    ["Offset of field: gclass__bindgen_ty_1::le_next"]
        [::std::mem::offset_of!(gclass__bindgen_ty_1, le_next) - 0usize];
    ["Offset of field: gclass__bindgen_ty_1::le_prev"]
        [::std::mem::offset_of!(gclass__bindgen_ty_1, le_prev) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gclass__bindgen_ty_2 {
    pub lh_first: *mut ggeom,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gclass__bindgen_ty_2"]
        [::std::mem::size_of::<gclass__bindgen_ty_2>() - 8usize];
    ["Alignment of gclass__bindgen_ty_2"]
        [::std::mem::align_of::<gclass__bindgen_ty_2>() - 8usize];
    ["Offset of field: gclass__bindgen_ty_2::lh_first"]
        [::std::mem::offset_of!(gclass__bindgen_ty_2, lh_first) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gclass"][::std::mem::size_of::<gclass>() - 48usize];
    ["Alignment of gclass"][::std::mem::align_of::<gclass>() - 8usize];
    ["Offset of field: gclass::lg_id"]
        [::std::mem::offset_of!(gclass, lg_id) - 0usize];
    ["Offset of field: gclass::lg_name"]
        [::std::mem::offset_of!(gclass, lg_name) - 8usize];
    ["Offset of field: gclass::lg_class"]
        [::std::mem::offset_of!(gclass, lg_class) - 16usize];
    ["Offset of field: gclass::lg_geom"]
        [::std::mem::offset_of!(gclass, lg_geom) - 32usize];
    ["Offset of field: gclass::lg_config"]
        [::std::mem::offset_of!(gclass, lg_config) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggeom {
    pub lg_id:       *mut ::std::os::raw::c_void,
    pub lg_class:    *mut gclass,
    pub lg_name:     *mut ::std::os::raw::c_char,
    pub lg_rank:     u_int,
    pub lg_geom:     ggeom__bindgen_ty_1,
    pub lg_consumer: ggeom__bindgen_ty_2,
    pub lg_provider: ggeom__bindgen_ty_3,
    pub lg_config:   gconf,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggeom__bindgen_ty_1 {
    pub le_next: *mut ggeom,
    pub le_prev: *mut *mut ggeom,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ggeom__bindgen_ty_1"]
        [::std::mem::size_of::<ggeom__bindgen_ty_1>() - 16usize];
    ["Alignment of ggeom__bindgen_ty_1"]
        [::std::mem::align_of::<ggeom__bindgen_ty_1>() - 8usize];
    ["Offset of field: ggeom__bindgen_ty_1::le_next"]
        [::std::mem::offset_of!(ggeom__bindgen_ty_1, le_next) - 0usize];
    ["Offset of field: ggeom__bindgen_ty_1::le_prev"]
        [::std::mem::offset_of!(ggeom__bindgen_ty_1, le_prev) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggeom__bindgen_ty_2 {
    pub lh_first: *mut gconsumer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ggeom__bindgen_ty_2"]
        [::std::mem::size_of::<ggeom__bindgen_ty_2>() - 8usize];
    ["Alignment of ggeom__bindgen_ty_2"]
        [::std::mem::align_of::<ggeom__bindgen_ty_2>() - 8usize];
    ["Offset of field: ggeom__bindgen_ty_2::lh_first"]
        [::std::mem::offset_of!(ggeom__bindgen_ty_2, lh_first) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggeom__bindgen_ty_3 {
    pub lh_first: *mut gprovider,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ggeom__bindgen_ty_3"]
        [::std::mem::size_of::<ggeom__bindgen_ty_3>() - 8usize];
    ["Alignment of ggeom__bindgen_ty_3"]
        [::std::mem::align_of::<ggeom__bindgen_ty_3>() - 8usize];
    ["Offset of field: ggeom__bindgen_ty_3::lh_first"]
        [::std::mem::offset_of!(ggeom__bindgen_ty_3, lh_first) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ggeom"][::std::mem::size_of::<ggeom>() - 72usize];
    ["Alignment of ggeom"][::std::mem::align_of::<ggeom>() - 8usize];
    ["Offset of field: ggeom::lg_id"]
        [::std::mem::offset_of!(ggeom, lg_id) - 0usize];
    ["Offset of field: ggeom::lg_class"]
        [::std::mem::offset_of!(ggeom, lg_class) - 8usize];
    ["Offset of field: ggeom::lg_name"]
        [::std::mem::offset_of!(ggeom, lg_name) - 16usize];
    ["Offset of field: ggeom::lg_rank"]
        [::std::mem::offset_of!(ggeom, lg_rank) - 24usize];
    ["Offset of field: ggeom::lg_geom"]
        [::std::mem::offset_of!(ggeom, lg_geom) - 32usize];
    ["Offset of field: ggeom::lg_consumer"]
        [::std::mem::offset_of!(ggeom, lg_consumer) - 48usize];
    ["Offset of field: ggeom::lg_provider"]
        [::std::mem::offset_of!(ggeom, lg_provider) - 56usize];
    ["Offset of field: ggeom::lg_config"]
        [::std::mem::offset_of!(ggeom, lg_config) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gconsumer {
    pub lg_id:        *mut ::std::os::raw::c_void,
    pub lg_geom:      *mut ggeom,
    pub lg_consumer:  gconsumer__bindgen_ty_1,
    pub lg_provider:  *mut gprovider,
    pub lg_consumers: gconsumer__bindgen_ty_2,
    pub lg_mode:      *mut ::std::os::raw::c_char,
    pub lg_config:    gconf,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gconsumer__bindgen_ty_1 {
    pub le_next: *mut gconsumer,
    pub le_prev: *mut *mut gconsumer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gconsumer__bindgen_ty_1"]
        [::std::mem::size_of::<gconsumer__bindgen_ty_1>() - 16usize];
    ["Alignment of gconsumer__bindgen_ty_1"]
        [::std::mem::align_of::<gconsumer__bindgen_ty_1>() - 8usize];
    ["Offset of field: gconsumer__bindgen_ty_1::le_next"]
        [::std::mem::offset_of!(gconsumer__bindgen_ty_1, le_next) - 0usize];
    ["Offset of field: gconsumer__bindgen_ty_1::le_prev"]
        [::std::mem::offset_of!(gconsumer__bindgen_ty_1, le_prev) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gconsumer__bindgen_ty_2 {
    pub le_next: *mut gconsumer,
    pub le_prev: *mut *mut gconsumer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gconsumer__bindgen_ty_2"]
        [::std::mem::size_of::<gconsumer__bindgen_ty_2>() - 16usize];
    ["Alignment of gconsumer__bindgen_ty_2"]
        [::std::mem::align_of::<gconsumer__bindgen_ty_2>() - 8usize];
    ["Offset of field: gconsumer__bindgen_ty_2::le_next"]
        [::std::mem::offset_of!(gconsumer__bindgen_ty_2, le_next) - 0usize];
    ["Offset of field: gconsumer__bindgen_ty_2::le_prev"]
        [::std::mem::offset_of!(gconsumer__bindgen_ty_2, le_prev) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gconsumer"][::std::mem::size_of::<gconsumer>() - 72usize];
    ["Alignment of gconsumer"][::std::mem::align_of::<gconsumer>() - 8usize];
    ["Offset of field: gconsumer::lg_id"]
        [::std::mem::offset_of!(gconsumer, lg_id) - 0usize];
    ["Offset of field: gconsumer::lg_geom"]
        [::std::mem::offset_of!(gconsumer, lg_geom) - 8usize];
    ["Offset of field: gconsumer::lg_consumer"]
        [::std::mem::offset_of!(gconsumer, lg_consumer) - 16usize];
    ["Offset of field: gconsumer::lg_provider"]
        [::std::mem::offset_of!(gconsumer, lg_provider) - 32usize];
    ["Offset of field: gconsumer::lg_consumers"]
        [::std::mem::offset_of!(gconsumer, lg_consumers) - 40usize];
    ["Offset of field: gconsumer::lg_mode"]
        [::std::mem::offset_of!(gconsumer, lg_mode) - 56usize];
    ["Offset of field: gconsumer::lg_config"]
        [::std::mem::offset_of!(gconsumer, lg_config) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gprovider {
    pub lg_id:           *mut ::std::os::raw::c_void,
    pub lg_name:         *mut ::std::os::raw::c_char,
    pub lg_geom:         *mut ggeom,
    pub lg_provider:     gprovider__bindgen_ty_1,
    pub lg_consumers:    gprovider__bindgen_ty_2,
    pub lg_mode:         *mut ::std::os::raw::c_char,
    pub lg_mediasize:    off_t,
    pub lg_sectorsize:   u_int,
    pub lg_stripeoffset: off_t,
    pub lg_stripesize:   off_t,
    pub lg_config:       gconf,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gprovider__bindgen_ty_1 {
    pub le_next: *mut gprovider,
    pub le_prev: *mut *mut gprovider,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gprovider__bindgen_ty_1"]
        [::std::mem::size_of::<gprovider__bindgen_ty_1>() - 16usize];
    ["Alignment of gprovider__bindgen_ty_1"]
        [::std::mem::align_of::<gprovider__bindgen_ty_1>() - 8usize];
    ["Offset of field: gprovider__bindgen_ty_1::le_next"]
        [::std::mem::offset_of!(gprovider__bindgen_ty_1, le_next) - 0usize];
    ["Offset of field: gprovider__bindgen_ty_1::le_prev"]
        [::std::mem::offset_of!(gprovider__bindgen_ty_1, le_prev) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gprovider__bindgen_ty_2 {
    pub lh_first: *mut gconsumer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gprovider__bindgen_ty_2"]
        [::std::mem::size_of::<gprovider__bindgen_ty_2>() - 8usize];
    ["Alignment of gprovider__bindgen_ty_2"]
        [::std::mem::align_of::<gprovider__bindgen_ty_2>() - 8usize];
    ["Offset of field: gprovider__bindgen_ty_2::lh_first"]
        [::std::mem::offset_of!(gprovider__bindgen_ty_2, lh_first) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gprovider"][::std::mem::size_of::<gprovider>() - 96usize];
    ["Alignment of gprovider"][::std::mem::align_of::<gprovider>() - 8usize];
    ["Offset of field: gprovider::lg_id"]
        [::std::mem::offset_of!(gprovider, lg_id) - 0usize];
    ["Offset of field: gprovider::lg_name"]
        [::std::mem::offset_of!(gprovider, lg_name) - 8usize];
    ["Offset of field: gprovider::lg_geom"]
        [::std::mem::offset_of!(gprovider, lg_geom) - 16usize];
    ["Offset of field: gprovider::lg_provider"]
        [::std::mem::offset_of!(gprovider, lg_provider) - 24usize];
    ["Offset of field: gprovider::lg_consumers"]
        [::std::mem::offset_of!(gprovider, lg_consumers) - 40usize];
    ["Offset of field: gprovider::lg_mode"]
        [::std::mem::offset_of!(gprovider, lg_mode) - 48usize];
    ["Offset of field: gprovider::lg_mediasize"]
        [::std::mem::offset_of!(gprovider, lg_mediasize) - 56usize];
    ["Offset of field: gprovider::lg_sectorsize"]
        [::std::mem::offset_of!(gprovider, lg_sectorsize) - 64usize];
    ["Offset of field: gprovider::lg_stripeoffset"]
        [::std::mem::offset_of!(gprovider, lg_stripeoffset) - 72usize];
    ["Offset of field: gprovider::lg_stripesize"]
        [::std::mem::offset_of!(gprovider, lg_stripesize) - 80usize];
    ["Offset of field: gprovider::lg_config"]
        [::std::mem::offset_of!(gprovider, lg_config) - 88usize];
};
unsafe extern "C" {
    pub fn geom_lookupid(
        arg1: *const gmesh,
        arg2: *const ::std::os::raw::c_void,
    ) -> *mut gident;
}
unsafe extern "C" {
    pub fn geom_xml2tree(
        arg1: *mut gmesh,
        arg2: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn geom_gettree(arg1: *mut gmesh) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn geom_gettree_geom(
        arg1: *mut gmesh,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn geom_deletetree(arg1: *mut gmesh);
}
unsafe extern "C" {
    pub fn gctl_free(arg1: *mut gctl_req);
}
unsafe extern "C" {
    pub fn gctl_get_handle() -> *mut gctl_req;
}
unsafe extern "C" {
    pub fn gctl_issue(arg1: *mut gctl_req) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gctl_add_param(
        req: *mut gctl_req,
        name: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
        value: *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn gctl_ro_param(
        arg1: *mut gctl_req,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn gctl_rw_param(
        arg1: *mut gctl_req,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn g_open(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_close(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_mediasize(arg1: ::std::os::raw::c_int) -> off_t;
}
unsafe extern "C" {
    pub fn g_sectorsize(arg1: ::std::os::raw::c_int) -> isize;
}
unsafe extern "C" {
    pub fn g_stripeoffset(arg1: ::std::os::raw::c_int) -> off_t;
}
unsafe extern "C" {
    pub fn g_stripesize(arg1: ::std::os::raw::c_int) -> off_t;
}
unsafe extern "C" {
    pub fn g_flush(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_delete(
        arg1: ::std::os::raw::c_int,
        arg2: off_t,
        arg3: off_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_get_ident(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_get_name(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_open_by_ident(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn g_device_path(
        arg1: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn g_providername(
        arg1: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
pub const devstat_support_flags_DEVSTAT_ALL_SUPPORTED: devstat_support_flags =
    0;
pub const devstat_support_flags_DEVSTAT_NO_BLOCKSIZE: devstat_support_flags = 1;
pub const devstat_support_flags_DEVSTAT_NO_ORDERED_TAGS: devstat_support_flags =
    2;
pub const devstat_support_flags_DEVSTAT_BS_UNAVAILABLE: devstat_support_flags =
    4;
pub type devstat_support_flags = ::std::os::raw::c_uint;
pub const devstat_trans_flags_DEVSTAT_NO_DATA: devstat_trans_flags = 0;
pub const devstat_trans_flags_DEVSTAT_READ: devstat_trans_flags = 1;
pub const devstat_trans_flags_DEVSTAT_WRITE: devstat_trans_flags = 2;
pub const devstat_trans_flags_DEVSTAT_FREE: devstat_trans_flags = 3;
pub type devstat_trans_flags = ::std::os::raw::c_uint;
pub const devstat_priority_DEVSTAT_PRIORITY_MIN: devstat_priority = 0;
pub const devstat_priority_DEVSTAT_PRIORITY_OTHER: devstat_priority = 32;
pub const devstat_priority_DEVSTAT_PRIORITY_PASS: devstat_priority = 48;
pub const devstat_priority_DEVSTAT_PRIORITY_FD: devstat_priority = 64;
pub const devstat_priority_DEVSTAT_PRIORITY_WFD: devstat_priority = 80;
pub const devstat_priority_DEVSTAT_PRIORITY_TAPE: devstat_priority = 96;
pub const devstat_priority_DEVSTAT_PRIORITY_CD: devstat_priority = 144;
pub const devstat_priority_DEVSTAT_PRIORITY_DISK: devstat_priority = 272;
pub const devstat_priority_DEVSTAT_PRIORITY_ARRAY: devstat_priority = 288;
pub const devstat_priority_DEVSTAT_PRIORITY_MAX: devstat_priority = 4095;
pub type devstat_priority = ::std::os::raw::c_uint;
pub const devstat_type_flags_DEVSTAT_TYPE_DIRECT: devstat_type_flags = 0;
pub const devstat_type_flags_DEVSTAT_TYPE_SEQUENTIAL: devstat_type_flags = 1;
pub const devstat_type_flags_DEVSTAT_TYPE_PRINTER: devstat_type_flags = 2;
pub const devstat_type_flags_DEVSTAT_TYPE_PROCESSOR: devstat_type_flags = 3;
pub const devstat_type_flags_DEVSTAT_TYPE_WORM: devstat_type_flags = 4;
pub const devstat_type_flags_DEVSTAT_TYPE_CDROM: devstat_type_flags = 5;
pub const devstat_type_flags_DEVSTAT_TYPE_SCANNER: devstat_type_flags = 6;
pub const devstat_type_flags_DEVSTAT_TYPE_OPTICAL: devstat_type_flags = 7;
pub const devstat_type_flags_DEVSTAT_TYPE_CHANGER: devstat_type_flags = 8;
pub const devstat_type_flags_DEVSTAT_TYPE_COMM: devstat_type_flags = 9;
pub const devstat_type_flags_DEVSTAT_TYPE_ASC0: devstat_type_flags = 10;
pub const devstat_type_flags_DEVSTAT_TYPE_ASC1: devstat_type_flags = 11;
pub const devstat_type_flags_DEVSTAT_TYPE_STORARRAY: devstat_type_flags = 12;
pub const devstat_type_flags_DEVSTAT_TYPE_ENCLOSURE: devstat_type_flags = 13;
pub const devstat_type_flags_DEVSTAT_TYPE_FLOPPY: devstat_type_flags = 14;
pub const devstat_type_flags_DEVSTAT_TYPE_MASK: devstat_type_flags = 15;
pub const devstat_type_flags_DEVSTAT_TYPE_IF_SCSI: devstat_type_flags = 16;
pub const devstat_type_flags_DEVSTAT_TYPE_IF_IDE: devstat_type_flags = 32;
pub const devstat_type_flags_DEVSTAT_TYPE_IF_OTHER: devstat_type_flags = 48;
pub const devstat_type_flags_DEVSTAT_TYPE_IF_NVME: devstat_type_flags = 64;
pub const devstat_type_flags_DEVSTAT_TYPE_IF_MASK: devstat_type_flags = 240;
pub const devstat_type_flags_DEVSTAT_TYPE_PASS: devstat_type_flags = 256;
pub type devstat_type_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct devstat {
    pub sequence0:     u_int,
    pub allocated:     ::std::os::raw::c_int,
    pub start_count:   u_int,
    pub end_count:     u_int,
    pub busy_from:     bintime,
    pub dev_links:     devstat__bindgen_ty_1,
    pub device_number: u_int32_t,
    pub device_name:   [::std::os::raw::c_char; 16usize],
    pub unit_number:   ::std::os::raw::c_int,
    pub bytes:         [u_int64_t; 4usize],
    pub operations:    [u_int64_t; 4usize],
    pub duration:      [bintime; 4usize],
    pub busy_time:     bintime,
    pub creation_time: bintime,
    pub block_size:    u_int32_t,
    pub tag_types:     [u_int64_t; 3usize],
    pub flags:         devstat_support_flags,
    pub device_type:   devstat_type_flags,
    pub priority:      devstat_priority,
    pub id:            *const ::std::os::raw::c_void,
    pub sequence1:     u_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct devstat__bindgen_ty_1 {
    pub stqe_next: *mut devstat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of devstat__bindgen_ty_1"]
        [::std::mem::size_of::<devstat__bindgen_ty_1>() - 8usize];
    ["Alignment of devstat__bindgen_ty_1"]
        [::std::mem::align_of::<devstat__bindgen_ty_1>() - 8usize];
    ["Offset of field: devstat__bindgen_ty_1::stqe_next"]
        [::std::mem::offset_of!(devstat__bindgen_ty_1, stqe_next) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of devstat"][::std::mem::size_of::<devstat>() - 288usize];
    ["Alignment of devstat"][::std::mem::align_of::<devstat>() - 8usize];
    ["Offset of field: devstat::sequence0"]
        [::std::mem::offset_of!(devstat, sequence0) - 0usize];
    ["Offset of field: devstat::allocated"]
        [::std::mem::offset_of!(devstat, allocated) - 4usize];
    ["Offset of field: devstat::start_count"]
        [::std::mem::offset_of!(devstat, start_count) - 8usize];
    ["Offset of field: devstat::end_count"]
        [::std::mem::offset_of!(devstat, end_count) - 12usize];
    ["Offset of field: devstat::busy_from"]
        [::std::mem::offset_of!(devstat, busy_from) - 16usize];
    ["Offset of field: devstat::dev_links"]
        [::std::mem::offset_of!(devstat, dev_links) - 32usize];
    ["Offset of field: devstat::device_number"]
        [::std::mem::offset_of!(devstat, device_number) - 40usize];
    ["Offset of field: devstat::device_name"]
        [::std::mem::offset_of!(devstat, device_name) - 44usize];
    ["Offset of field: devstat::unit_number"]
        [::std::mem::offset_of!(devstat, unit_number) - 60usize];
    ["Offset of field: devstat::bytes"]
        [::std::mem::offset_of!(devstat, bytes) - 64usize];
    ["Offset of field: devstat::operations"]
        [::std::mem::offset_of!(devstat, operations) - 96usize];
    ["Offset of field: devstat::duration"]
        [::std::mem::offset_of!(devstat, duration) - 128usize];
    ["Offset of field: devstat::busy_time"]
        [::std::mem::offset_of!(devstat, busy_time) - 192usize];
    ["Offset of field: devstat::creation_time"]
        [::std::mem::offset_of!(devstat, creation_time) - 208usize];
    ["Offset of field: devstat::block_size"]
        [::std::mem::offset_of!(devstat, block_size) - 224usize];
    ["Offset of field: devstat::tag_types"]
        [::std::mem::offset_of!(devstat, tag_types) - 232usize];
    ["Offset of field: devstat::flags"]
        [::std::mem::offset_of!(devstat, flags) - 256usize];
    ["Offset of field: devstat::device_type"]
        [::std::mem::offset_of!(devstat, device_type) - 260usize];
    ["Offset of field: devstat::priority"]
        [::std::mem::offset_of!(devstat, priority) - 264usize];
    ["Offset of field: devstat::id"]
        [::std::mem::offset_of!(devstat, id) - 272usize];
    ["Offset of field: devstat::sequence1"]
        [::std::mem::offset_of!(devstat, sequence1) - 280usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gctl_req_table {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sbuf {
    pub _address: u8,
}
